/*M!999999\- enable the sandbox mode */ 
-- MariaDB dump 10.19  Distrib 10.6.22-MariaDB, for Win64 (AMD64)
--
-- Host: localhost    Database: test
-- ------------------------------------------------------
-- Server version	10.6.22-MariaDB

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `foodcal`
--
USE test;
DROP TABLE IF EXISTS `foodcal`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8mb4 */;
CREATE TABLE `foodcal` (
  `FOOD` varchar(20) NOT NULL,
  `CAL` int(11) NOT NULL,
  PRIMARY KEY (`FOOD`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `foodcal`
--

LOCK TABLES `foodcal` WRITE;
/*!40000 ALTER TABLE `foodcal` DISABLE KEYS */;
INSERT INTO `foodcal` VALUES ('김밥',100),('돈까스',400),('떡볶이',300),('볶음밥',360),('순대',200),('오므라이스',200),('우동',250),('잔치국수',350),('제육덮밥',450),('짜장면',150);
/*!40000 ALTER TABLE `foodcal` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `foodcal_records`
--

DROP TABLE IF EXISTS `foodcal_records`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8mb4 */;
CREATE TABLE `foodcal_records` (
  `allfood` varchar(2000) NOT NULL,
  `allcalories` int(11) NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `foodcal_records`
--

LOCK TABLES `foodcal_records` WRITE;
/*!40000 ALTER TABLE `foodcal_records` DISABLE KEYS */;
INSERT INTO `foodcal_records` VALUES ('김밥, 돈까스, 순대, 우동, 잔치국수, 제육덮밥, 짜장면, 우동, 오므라이스, 돈까스, 돈까스, 돈까스, 돈까스',100,'2025-05-21 01:18:02'),('김밥, 돈까스, 순대, 우동, 잔치국수, 제육덮밥, 짜장면, 우동, 오므라이스, 돈까스, 돈까스, 돈까스, 돈까스',3950,'2025-05-21 01:23:41'),('김밥, 돈까스, 순대, 우동, 잔치국수, 제육덮밥, 짜장면, 우동, 오므라이스, 돈까스, 돈까스, 돈까스, 돈까스',3950,'2025-05-21 01:26:46'),('김밥, 돈까스, 순대, 우동, 잔치국수, 제육덮밥, 짜장면, 우동, 오므라이스, 돈까스, 돈까스, 돈까스, 돈까스',3950,'2025-05-21 01:30:28'),('김밥, 돈까스, 순대, 우동, 잔치국수, 제육덮밥, 짜장면, 우동, 오므라이스, 돈까스, 돈까스, 돈까스, 돈까스',3950,'2025-05-21 01:34:31'),('김밥, 돈까스, 순대, 우동, 잔치국수, 제육덮밥, 짜장면, 우동, 오므라이스, 돈까스, 돈까스, 돈까스, 돈까스',3950,'2025-05-21 01:38:42'),('김밥, 돈까스, 순대, 우동, 잔치국수, 제육덮밥, 짜장면, 우동, 오므라이스, 돈까스, 돈까스, 돈까스, 돈까스',3950,'2025-05-21 01:39:52'),('김밥, 돈까스, 순대, 우동, 잔치국수, 제육덮밥, 짜장면, 우동, 오므라이스, 돈까스, 돈까스, 돈까스, 돈까스',3950,'2025-05-21 01:40:10'),('김밥, 돈까스, 순대, 우동, 잔치국수, 제육덮밥, 짜장면, 우동, 오므라이스, 돈까스, 돈까스, 돈까스, 돈까스',3950,'2025-05-21 01:40:59'),('김밥, 돈까스, 순대, 우동, 잔치국수, 제육덮밥, 짜장면, 우동, 오므라이스, 돈까스, 돈까스, 돈까스, 돈까스',3950,'2025-05-21 01:42:02'),('김밥, 돈까스, 순대, 우동, 잔치국수, 제육덮밥, 짜장면, 우동, 오므라이스, 돈까스, 돈까스, 돈까스, 돈까스',3950,'2025-05-21 01:48:13'),('김밥, 돈까스, 순대, 우동, 잔치국수, 제육덮밥, 짜장면, 우동, 오므라이스, 돈까스, 돈까스, 돈까스, 돈까스',3950,'2025-05-21 01:49:20'),('김밥, 돈까스, 순대, 우동, 잔치국수, 제육덮밥, 짜장면, 우동, 오므라이스, 돈까스, 돈까스, 돈까스, 돈까스',3950,'2025-05-21 01:53:50'),('김밥, 돈까스, 순대, 우동, 잔치국수, 제육덮밥, 짜장면, 우동, 오므라이스, 돈까스, 돈까스, 돈까스, 돈까스',3950,'2025-05-21 01:58:06'),('김밥, 돈까스, 순대, 우동, 잔치국수, 제육덮밥, 짜장면, 우동, 오므라이스, 돈까스, 돈까스, 돈까스, 돈까스',3950,'2025-05-21 01:58:51'),('김밥',100,'2025-05-21 02:01:57'),('김밥',100,'2025-05-21 02:04:44'),('김밥',100,'2025-05-21 02:05:42'),('김밥',100,'2025-05-21 02:06:09'),('김밥',100,'2025-05-21 02:06:39'),('김밥',100,'2025-05-21 02:06:52'),('김밥, 돈까스',500,'2025-05-21 02:12:52'),('김밥, 돈까스',500,'2025-05-21 02:13:08'),('김밥, 돈까스',500,'2025-05-21 02:13:43'),('김밥, 돈까스',500,'2025-05-21 02:14:48'),('김밥, 돈까스, 순대, 우동, 잔치국수, 제육덮밥, 짜장면, 우동, 오므라이스, 돈까스, 돈까스, 돈까스, 돈까스',3950,'2025-05-21 02:16:28'),('김밥, 돈까스, 순대, 우동, 잔치국수, 제육덮밥, 짜장면, 우동, 오므라이스, 돈까스, 돈까스, 돈까스, 돈까스',3950,'2025-05-21 02:16:44'),('김밥, 돈까스',500,'2025-05-21 02:16:57'),('김밥, 돈까스, 순대, 우동, 잔치국수, 제육덮밥, 짜장면, 우동, 오므라이스, 돈까스, 돈까스, 돈까스, 돈까스',3950,'2025-05-21 02:17:53'),('김밥, 돈까스, 순대, 우동, 잔치국수, 제육덮밥, 짜장면, 우동, 오므라이스, 돈까스, 돈까스, 돈까스, 돈까스',3950,'2025-05-21 02:18:55'),('김밥',100,'2025-05-21 02:31:06'),('김밥',100,'2025-05-21 02:33:51'),('김밥, 돈까스\r\n',500,'2025-05-21 02:50:05'),('김밥, 돈까스\r\n',500,'2025-05-21 02:50:37'),('김밥, 돈까스\r\n',500,'2025-05-21 02:53:34'),('김밥, 돈까스\r\n',500,'2025-05-21 02:53:37'),('김밥',100,'2025-05-21 02:53:54'),('김밥',100,'2025-05-21 02:54:02'),('김밥',100,'2025-05-21 02:54:03'),('김밥',100,'2025-05-21 02:54:05'),('김밥',100,'2025-05-21 02:54:27'),('김밥',100,'2025-05-21 02:56:43'),('김밥',100,'2025-05-21 03:02:04'),('김밥',100,'2025-05-21 03:04:40'),('김밥',100,'2025-05-21 03:05:58'),('김밥',100,'2025-05-21 03:07:47'),('김밥',100,'2025-05-21 03:07:49'),('김밥',100,'2025-05-21 03:08:29'),('김밥',100,'2025-05-21 03:10:36'),('김밥',100,'2025-05-21 03:13:34'),('김밥, 돈까스, 순대, 우동, 잔치국수, 제육덮밥, 짜장면, 우동, 오므라이스, 돈까스, 돈까스, 돈까스, 돈까스',3950,'2025-05-21 03:14:05'),('김밥, 돈까스, 순대, 우동, 잔치국수, 제육덮밥, 짜장면, 우동, 오므라이스, 돈까스, 돈까스, 돈까스, 돈까스',3950,'2025-05-21 03:20:02'),('돈까스',400,'2025-05-21 03:20:31'),('김밥',100,'2025-05-21 03:21:55'),('우동',250,'2025-05-21 03:22:08'),('돈까스',400,'2025-05-21 03:29:36'),('돈까스, 돈까스,돈까스,돈까스,돈까스,돈까스',2400,'2025-05-21 03:30:25'),('돈까스,돈까스,돈까스,돈까스,돈까스,돈까스,김밥',2500,'2025-05-21 03:30:52'),('돈까스,돈까스,돈까스,돈까스,돈까스,돈까스,김밥',2500,'2025-05-21 03:38:58'),('돈까스,돈까스,돈까스,돈까스,돈까스,돈까스,김밥',2500,'2025-05-21 03:39:31'),('돈까스,돈까스,돈까스,돈까스,돈까스,돈까스,김밥',2500,'2025-05-21 03:41:41'),('돈까스,돈까스,돈까스,돈까스,돈까스,돈까스,김밥',2500,'2025-05-21 03:47:50'),('돈까스,돈까스,돈까스,돈까스,돈까스,돈까스,김밥',2500,'2025-05-21 03:48:22'),('돈까스, 돈까스,돈까스,돈까스,돈까스',2000,'2025-05-21 03:50:43'),('김밥, 돈까스, 짜장면, 우동',900,'2025-05-21 04:43:41'),('돈까스,돈까스,돈까스,돈까스,돈까스,돈까스,돈까스,돈까스',3200,'2025-05-21 04:45:13'),('돈까스,돈까스,돈까스,돈까스,돈까스,돈까스,돈까스,돈까스',3200,'2025-05-21 04:56:49'),('돈까스,돈까스,돈까스,돈까스,돈까스,돈까스,돈까스,돈까스',3200,'2025-05-21 04:57:49'),('돈까스,돈까스,돈까스,돈까스,돈까스,돈까스,돈까스,돈까스',3200,'2025-05-21 04:58:47'),('돈까스,돈까스,돈까스,돈까스,돈까스,돈까스,돈까스,돈까스',3200,'2025-05-21 05:04:56'),('돈까스,돈까스,돈까스,돈까스,돈까스,돈까스,돈까스,돈까스',3200,'2025-05-21 05:07:30'),('돈까스,돈까스,돈까스,돈까스,돈까스,돈까스,돈까스,돈까스',3200,'2025-05-21 05:08:14'),('돈까스',400,'2025-05-21 05:11:43'),('돈까스,돈까스,돈까스,돈까스,돈까스,돈까스,돈까스,돈까스',3200,'2025-05-21 05:16:01'),('돈까스,돈까스,돈까스,돈까스,돈까스,돈까스,돈까스,돈까스',3200,'2025-05-21 05:55:12'),('돈까스,돈까스,돈까스,돈까스,돈까스,돈까스,돈까스,돈까스',3200,'2025-05-21 05:55:26'),('돈까스,돈까스,돈까스,돈까스,돈까스,돈까스,돈까스,돈까스',3200,'2025-05-21 05:55:50'),('돈까스,돈까스,돈까스,돈까스,돈까스,돈까스,돈까스,돈까스',3200,'2025-05-21 05:56:07'),('돈까스,돈까스,돈까스,돈까스,돈까스,돈까스,돈까스,돈까스',3200,'2025-05-21 05:59:21'),('돈까스,돈까스,돈까스,돈까스,돈까스,돈까스,돈까스,돈까스',3200,'2025-05-21 05:59:39'),('돈까스,돈까스,돈까스,돈까스,돈까스,돈까스,돈까스,돈까스',3200,'2025-05-21 06:00:59'),('김밥\r\n',100,'2025-05-21 06:01:15'),('김밥\r\n',100,'2025-05-21 06:01:59'),('김밥\r\n',100,'2025-05-21 06:02:17'),('김치찌깨 ',0,'2025-05-21 06:05:32'),('김밥, 떡볶이, 돈까스, 짜장면',950,'2025-05-21 06:05:36'),('김밥, 짜장면',250,'2025-05-21 06:05:53'),('스테이크',0,'2025-05-21 06:05:59'),('김밥, 짜장면, 돈까스, 떡볶이',950,'2025-05-21 06:06:05'),('짜장면\r\n',150,'2025-05-21 06:06:11'),('치킨\r\n',0,'2025-05-21 06:06:24'),('123124125',0,'2025-05-21 06:08:25'),('12431254125',0,'2025-05-21 06:09:01'),('김밥, 돈까스, 짜장면',650,'2025-05-21 06:22:38'),('돈까스,돈까스,돈까스,돈까스,돈까스,돈까스,돈까스,돈까스,',3200,'2025-05-21 06:23:04'),('',0,'2025-05-21 06:23:57'),('',0,'2025-05-21 06:25:14'),('짬뽕',0,'2025-05-21 06:25:46'),('',0,'2025-05-21 06:26:50'),('돈까스, 김밥, 짜장면, 오므라이스\r\n',850,'2025-05-21 06:29:04'),('돈까스, 짜장면, 오므라이스, 제육덮밥',1200,'2025-05-21 06:29:25'),('김밥, 김밥, 김밥, 김밥, 김밥, 김밥, 김밥, 김밥, 김밥, 김밥, ',1000,'2025-05-21 06:29:52'),('떡볶이, 김밥, 돈까스',800,'2025-05-21 06:30:52'),('돈까스, 김밥, 짜장면, 오므라이스',850,'2025-05-21 06:32:51'),('김밥\r\n떡볶이 \r\n순대\r\n',0,'2025-05-21 06:38:36'),('돈까스,돈까스, 돈까스',1200,'2025-05-21 06:47:55'),('김밥, 볶음밥, 순대, 제육덮밥',1110,'2025-05-21 07:01:04'),('김밥',100,'2025-05-21 07:04:57'),('김밥, 돈까스, 순대 ',700,'2025-05-21 07:05:25'),('돈까스,돈까스,돈까스,돈까스,돈까스,돈까스,돈까스,돈까스',3200,'2025-05-21 07:06:27'),('돈까스,오므라이스,우동',850,'2025-05-21 07:07:26'),('돈까스,돈까스,돈까스,돈까스,돈까스,돈까스,돈까스,돈까스,',3200,'2025-05-21 07:08:02'),('돈까스,돈까스,돈까스,돈까스,돈까스,돈까스,돈까스,돈까스',3200,'2025-05-21 07:10:52'),('돈까스',400,'2025-05-21 07:11:28'),('김밥, 돈까스, 떡볶이, 볶음밥',1160,'2025-05-21 08:27:52');
/*!40000 ALTER TABLE `foodcal_records` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `exercise`
--

DROP TABLE IF EXISTS `exercise`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8mb4 */;
CREATE TABLE `exercise` (
  `exercise` varchar(2000) NOT NULL,
  `exercise_time` int(11) NOT NULL,
  `exercise_cal` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `exercise`
--

LOCK TABLES `exercise` WRITE;
/*!40000 ALTER TABLE `exercise` DISABLE KEYS */;
INSERT INTO `exercise` VALUES ('달리기',1,100),('근력운동',1,300),('클라이밍',1,200),('수영',1,250);
/*!40000 ALTER TABLE `exercise` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2025-05-21 17:40:07
